Autodesk.Revit.DB.ContentNode
This class represents a generic content node in a model-exporting process.
Remarks:
Members of this class implement properties and methods
common to all content classes, such as RPC and Light nodes.
Attributes of a content note can be accessed via an Asset object.
Since:
2014